{
    "Test validation message for unit test" = "SUCCESS";
    NullPropertyException = "Veuillez fournir un/une <b>@@context.displayNameForProperty@@</b>.";
    MandatoryToOneRelationshipException = "Un/Une <b>@@context.displayNameForEntity@@</b> doit avoir un/une  <b>@@context.displayNameForProperty@@</b>.";
    MandatoryToManyRelationshipException = "Un/une <b>@@context.displayNameForEntity@@</b> doit avoir au moins un/une  <b>@@context.displayNameForEntity@@</b>.";
    ObjectRemovalException = "Impossible d'enlever ce/cette <b>@@context.displayNameForEntity@@</b>. Vous devez d'abord enlever le/la <b>@@context.displayNameForProperty@@</b>.";
    ObjectsRemovalException = "Impossible d'enlever ce/cette <b>@@context.displayNameForEntity@@</b>. Vous devez d'abord enlever les <b>@@context.displayNameForProperty@@</b>.";
        
    IllegalCharacterInNumberException = "Veuillez vérifier la valeur que vous avez fournie pour le champ <b>@@displayNameForProperty@@</b>.";
    NotANumberException = "Désolé, je ne peux lire ce nombre <b>@@value@@</b> ";
    InvalidNumberException = "Le nombre est invalide";
    InvalidDateFormatException="Veuillez vérifier<b>@@context.displayNameForProperty@@</b> car <b>@@value@@</b> n'est pas une date valide."; 

    PasswordsFillBothFieldsException = "Veuillez remplir les deux champs de mot de passe.";
    PasswordsDontMatchException = "Les <b>mots de passe<b> que vous avez rentrés sont différents.";
}
